cherry-embedded/CherryUSB/port/rp2040/usb_rp2040_reg.h
#pragma once
#include <stdint.h>

#if defined(__GNUC__) && (__GNUC__ <= 6 || (__GNUC__ == 7 && (__GNUC_MINOR__ < 3 || !defined(__cplusplus))))
#ifndef __force_inline
#define __force_inline inline __always_inline
#endif
#else
#ifndef __force_inline
#define __force_inline __always_inline
#endif
#endif

// 0-15
#define USB_NUM_ENDPOINTS 16
// 1-15
#define USB_HOST_INTERRUPT_ENDPOINTS (USB_NUM_ENDPOINTS - 1)

// ep_inout_ctrl bits
#define EP_CTRL_ENABLE_BITS                 (1u << 31u)
#define EP_CTRL_DOUBLE_BUFFERED_BITS        (1u << 30)
#define EP_CTRL_INTERRUPT_PER_BUFFER        (1u << 29)
#define EP_CTRL_INTERRUPT_PER_DOUBLE_BUFFER (1u << 28)
#define EP_CTRL_INTERRUPT_ON_NAK            (1u << 16)
#define EP_CTRL_INTERRUPT_ON_STALL          (1u << 17)
#define EP_CTRL_BUFFER_TYPE_LSB             26u
#define EP_CTRL_HOST_INTERRUPT_INTERVAL_LSB 16u

// Endpoint buffer control bits
#define USB_BUF_CTRL_FULL      0x00008000u
#define USB_BUF_CTRL_LAST      0x00004000u
#define USB_BUF_CTRL_DATA0_PID 0x00000000u
#define USB_BUF_CTRL_DATA1_PID 0x00002000u
#define USB_BUF_CTRL_SEL       0x00001000u
#define USB_BUF_CTRL_STALL     0x00000800u
#define USB_BUF_CTRL_AVAIL     0x00000400u
#define USB_BUF_CTRL_LEN_MASK  0x000003FFu
#define USB_BUF_CTRL_LEN_LSB   0

#define USB_DPRAM_SIZE 4096u
// PICO_CONFIG: USB_DPRAM_MAX, Set amount of USB RAM used by USB system, min=0, max=4096, default=4096, group=hardware_usb
// Allow user to claim some of the USB RAM for themselves
#ifndef USB_DPRAM_MAX
#define USB_DPRAM_MAX USB_DPRAM_SIZE
#endif

#define _REG_(x)
#ifndef _u
#define _u(x) x##u
#endif
typedef volatile uint32_t io_rw_32;
typedef volatile uint32_t io_wo_32;
typedef const volatile uint32_t io_ro_32;

// =============================================================================
// Register    : RESETS_RESET
// Description : Reset control. If a bit is set it means the peripheral is in
//               reset. 0 means the peripheral's reset is deasserted.
#define RESETS_RESET_OFFSET _u(0x00000000)
#define RESETS_RESET_BITS   _u(0x01ffffff)
#define RESETS_RESET_RESET  _u(0x01ffffff)
// =============================================================================
// Register    : RESETS_WDSEL
// Description : Watchdog select. If a bit is set then the watchdog will reset
//               this peripheral when the watchdog fires.
#define RESETS_WDSEL_OFFSET _u(0x00000004)
#define RESETS_WDSEL_BITS   _u(0x01ffffff)
#define RESETS_WDSEL_RESET  _u(0x00000000)
// =============================================================================
// Register    : RESETS_RESET_DONE
// Description : Reset done. If a bit is set then a reset done signal has been
//               returned by the peripheral. This indicates that the
//               peripheral's registers are ready to be accessed.
#define RESETS_RESET_DONE_OFFSET _u(0x00000008)
#define RESETS_RESET_DONE_BITS   _u(0x01ffffff)
#define RESETS_RESET_DONE_RESET  _u(0x00000000)

// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_USBCTRL
// Description : None
#define RESETS_RESET_USBCTRL_RESET  _u(0x1)
#define RESETS_RESET_USBCTRL_BITS   _u(0x01000000)
#define RESETS_RESET_USBCTRL_MSB    _u(24)
#define RESETS_RESET_USBCTRL_LSB    _u(24)
#define RESETS_RESET_USBCTRL_ACCESS "RW"
// =============================================================================
// Register    : USB_ADDR_ENDP
// Description : Device address and endpoint control
#define USB_ADDR_ENDP_OFFSET _u(0x00000000)
#define USB_ADDR_ENDP_BITS   _u(0x000f007f)
#define USB_ADDR_ENDP_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP_ENDPOINT
// Description : Device endpoint to send data to. Only valid for HOST mode.
#define USB_ADDR_ENDP_ENDPOINT_RESET  _u(0x0)
#define USB_ADDR_ENDP_ENDPOINT_BITS   _u(0x000f0000)
#define USB_ADDR_ENDP_ENDPOINT_MSB    _u(19)
#define USB_ADDR_ENDP_ENDPOINT_LSB    _u(16)
#define USB_ADDR_ENDP_ENDPOINT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP_ADDRESS
// Description : In device mode, the address that the device should respond to.
//               Set in response to a SET_ADDR setup packet from the host. In
//               host mode set to the address of the device to communicate with.
#define USB_ADDR_ENDP_ADDRESS_RESET  _u(0x00)
#define USB_ADDR_ENDP_ADDRESS_BITS   _u(0x0000007f)
#define USB_ADDR_ENDP_ADDRESS_MSB    _u(6)
#define USB_ADDR_ENDP_ADDRESS_LSB    _u(0)
#define USB_ADDR_ENDP_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : USB_ADDR_ENDP1
// Description : Interrupt endpoint 1. Only valid for HOST mode.
#define USB_ADDR_ENDP1_OFFSET _u(0x00000004)
#define USB_ADDR_ENDP1_BITS   _u(0x060f007f)
#define USB_ADDR_ENDP1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP1_INTEP_PREAMBLE
// Description : Interrupt EP requires preamble (is a low speed device on a full
//               speed hub)
#define USB_ADDR_ENDP1_INTEP_PREAMBLE_RESET  _u(0x0)
#define USB_ADDR_ENDP1_INTEP_PREAMBLE_BITS   _u(0x04000000)
#define USB_ADDR_ENDP1_INTEP_PREAMBLE_MSB    _u(26)
#define USB_ADDR_ENDP1_INTEP_PREAMBLE_LSB    _u(26)
#define USB_ADDR_ENDP1_INTEP_PREAMBLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP1_INTEP_DIR
// Description : Direction of the interrupt endpoint. In=0, Out=1
#define USB_ADDR_ENDP1_INTEP_DIR_RESET  _u(0x0)
#define USB_ADDR_ENDP1_INTEP_DIR_BITS   _u(0x02000000)
#define USB_ADDR_ENDP1_INTEP_DIR_MSB    _u(25)
#define USB_ADDR_ENDP1_INTEP_DIR_LSB    _u(25)
#define USB_ADDR_ENDP1_INTEP_DIR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP1_ENDPOINT
// Description : Endpoint number of the interrupt endpoint
#define USB_ADDR_ENDP1_ENDPOINT_RESET  _u(0x0)
#define USB_ADDR_ENDP1_ENDPOINT_BITS   _u(0x000f0000)
#define USB_ADDR_ENDP1_ENDPOINT_MSB    _u(19)
#define USB_ADDR_ENDP1_ENDPOINT_LSB    _u(16)
#define USB_ADDR_ENDP1_ENDPOINT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP1_ADDRESS
// Description : Device address
#define USB_ADDR_ENDP1_ADDRESS_RESET  _u(0x00)
#define USB_ADDR_ENDP1_ADDRESS_BITS   _u(0x0000007f)
#define USB_ADDR_ENDP1_ADDRESS_MSB    _u(6)
#define USB_ADDR_ENDP1_ADDRESS_LSB    _u(0)
#define USB_ADDR_ENDP1_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : USB_ADDR_ENDP2
// Description : Interrupt endpoint 2. Only valid for HOST mode.
#define USB_ADDR_ENDP2_OFFSET _u(0x00000008)
#define USB_ADDR_ENDP2_BITS   _u(0x060f007f)
#define USB_ADDR_ENDP2_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP2_INTEP_PREAMBLE
// Description : Interrupt EP requires preamble (is a low speed device on a full
//               speed hub)
#define USB_ADDR_ENDP2_INTEP_PREAMBLE_RESET  _u(0x0)
#define USB_ADDR_ENDP2_INTEP_PREAMBLE_BITS   _u(0x04000000)
#define USB_ADDR_ENDP2_INTEP_PREAMBLE_MSB    _u(26)
#define USB_ADDR_ENDP2_INTEP_PREAMBLE_LSB    _u(26)
#define USB_ADDR_ENDP2_INTEP_PREAMBLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP2_INTEP_DIR
// Description : Direction of the interrupt endpoint. In=0, Out=1
#define USB_ADDR_ENDP2_INTEP_DIR_RESET  _u(0x0)
#define USB_ADDR_ENDP2_INTEP_DIR_BITS   _u(0x02000000)
#define USB_ADDR_ENDP2_INTEP_DIR_MSB    _u(25)
#define USB_ADDR_ENDP2_INTEP_DIR_LSB    _u(25)
#define USB_ADDR_ENDP2_INTEP_DIR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP2_ENDPOINT
// Description : Endpoint number of the interrupt endpoint
#define USB_ADDR_ENDP2_ENDPOINT_RESET  _u(0x0)
#define USB_ADDR_ENDP2_ENDPOINT_BITS   _u(0x000f0000)
#define USB_ADDR_ENDP2_ENDPOINT_MSB    _u(19)
#define USB_ADDR_ENDP2_ENDPOINT_LSB    _u(16)
#define USB_ADDR_ENDP2_ENDPOINT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP2_ADDRESS
// Description : Device address
#define USB_ADDR_ENDP2_ADDRESS_RESET  _u(0x00)
#define USB_ADDR_ENDP2_ADDRESS_BITS   _u(0x0000007f)
#define USB_ADDR_ENDP2_ADDRESS_MSB    _u(6)
#define USB_ADDR_ENDP2_ADDRESS_LSB    _u(0)
#define USB_ADDR_ENDP2_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : USB_ADDR_ENDP3
// Description : Interrupt endpoint 3. Only valid for HOST mode.
#define USB_ADDR_ENDP3_OFFSET _u(0x0000000c)
#define USB_ADDR_ENDP3_BITS   _u(0x060f007f)
#define USB_ADDR_ENDP3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP3_INTEP_PREAMBLE
// Description : Interrupt EP requires preamble (is a low speed device on a full
//               speed hub)
#define USB_ADDR_ENDP3_INTEP_PREAMBLE_RESET  _u(0x0)
#define USB_ADDR_ENDP3_INTEP_PREAMBLE_BITS   _u(0x04000000)
#define USB_ADDR_ENDP3_INTEP_PREAMBLE_MSB    _u(26)
#define USB_ADDR_ENDP3_INTEP_PREAMBLE_LSB    _u(26)
#define USB_ADDR_ENDP3_INTEP_PREAMBLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP3_INTEP_DIR
// Description : Direction of the interrupt endpoint. In=0, Out=1
#define USB_ADDR_ENDP3_INTEP_DIR_RESET  _u(0x0)
#define USB_ADDR_ENDP3_INTEP_DIR_BITS   _u(0x02000000)
#define USB_ADDR_ENDP3_INTEP_DIR_MSB    _u(25)
#define USB_ADDR_ENDP3_INTEP_DIR_LSB    _u(25)
#define USB_ADDR_ENDP3_INTEP_DIR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP3_ENDPOINT
// Description : Endpoint number of the interrupt endpoint
#define USB_ADDR_ENDP3_ENDPOINT_RESET  _u(0x0)
#define USB_ADDR_ENDP3_ENDPOINT_BITS   _u(0x000f0000)
#define USB_ADDR_ENDP3_ENDPOINT_MSB    _u(19)
#define USB_ADDR_ENDP3_ENDPOINT_LSB    _u(16)
#define USB_ADDR_ENDP3_ENDPOINT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP3_ADDRESS
// Description : Device address
#define USB_ADDR_ENDP3_ADDRESS_RESET  _u(0x00)
#define USB_ADDR_ENDP3_ADDRESS_BITS   _u(0x0000007f)
#define USB_ADDR_ENDP3_ADDRESS_MSB    _u(6)
#define USB_ADDR_ENDP3_ADDRESS_LSB    _u(0)
#define USB_ADDR_ENDP3_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : USB_ADDR_ENDP4
// Description : Interrupt endpoint 4. Only valid for HOST mode.
#define USB_ADDR_ENDP4_OFFSET _u(0x00000010)
#define USB_ADDR_ENDP4_BITS   _u(0x060f007f)
#define USB_ADDR_ENDP4_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP4_INTEP_PREAMBLE
// Description : Interrupt EP requires preamble (is a low speed device on a full
//               speed hub)
#define USB_ADDR_ENDP4_INTEP_PREAMBLE_RESET  _u(0x0)
#define USB_ADDR_ENDP4_INTEP_PREAMBLE_BITS   _u(0x04000000)
#define USB_ADDR_ENDP4_INTEP_PREAMBLE_MSB    _u(26)
#define USB_ADDR_ENDP4_INTEP_PREAMBLE_LSB    _u(26)
#define USB_ADDR_ENDP4_INTEP_PREAMBLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP4_INTEP_DIR
// Description : Direction of the interrupt endpoint. In=0, Out=1
#define USB_ADDR_ENDP4_INTEP_DIR_RESET  _u(0x0)
#define USB_ADDR_ENDP4_INTEP_DIR_BITS   _u(0x02000000)
#define USB_ADDR_ENDP4_INTEP_DIR_MSB    _u(25)
#define USB_ADDR_ENDP4_INTEP_DIR_LSB    _u(25)
#define USB_ADDR_ENDP4_INTEP_DIR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP4_ENDPOINT
// Description : Endpoint number of the interrupt endpoint
#define USB_ADDR_ENDP4_ENDPOINT_RESET  _u(0x0)
#define USB_ADDR_ENDP4_ENDPOINT_BITS   _u(0x000f0000)
#define USB_ADDR_ENDP4_ENDPOINT_MSB    _u(19)
#define USB_ADDR_ENDP4_ENDPOINT_LSB    _u(16)
#define USB_ADDR_ENDP4_ENDPOINT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP4_ADDRESS
// Description : Device address
#define USB_ADDR_ENDP4_ADDRESS_RESET  _u(0x00)
#define USB_ADDR_ENDP4_ADDRESS_BITS   _u(0x0000007f)
#define USB_ADDR_ENDP4_ADDRESS_MSB    _u(6)
#define USB_ADDR_ENDP4_ADDRESS_LSB    _u(0)
#define USB_ADDR_ENDP4_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : USB_ADDR_ENDP5
// Description : Interrupt endpoint 5. Only valid for HOST mode.
#define USB_ADDR_ENDP5_OFFSET _u(0x00000014)
#define USB_ADDR_ENDP5_BITS   _u(0x060f007f)
#define USB_ADDR_ENDP5_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP5_INTEP_PREAMBLE
// Description : Interrupt EP requires preamble (is a low speed device on a full
//               speed hub)
#define USB_ADDR_ENDP5_INTEP_PREAMBLE_RESET  _u(0x0)
#define USB_ADDR_ENDP5_INTEP_PREAMBLE_BITS   _u(0x04000000)
#define USB_ADDR_ENDP5_INTEP_PREAMBLE_MSB    _u(26)
#define USB_ADDR_ENDP5_INTEP_PREAMBLE_LSB    _u(26)
#define USB_ADDR_ENDP5_INTEP_PREAMBLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP5_INTEP_DIR
// Description : Direction of the interrupt endpoint. In=0, Out=1
#define USB_ADDR_ENDP5_INTEP_DIR_RESET  _u(0x0)
#define USB_ADDR_ENDP5_INTEP_DIR_BITS   _u(0x02000000)
#define USB_ADDR_ENDP5_INTEP_DIR_MSB    _u(25)
#define USB_ADDR_ENDP5_INTEP_DIR_LSB    _u(25)
#define USB_ADDR_ENDP5_INTEP_DIR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP5_ENDPOINT
// Description : Endpoint number of the interrupt endpoint
#define USB_ADDR_ENDP5_ENDPOINT_RESET  _u(0x0)
#define USB_ADDR_ENDP5_ENDPOINT_BITS   _u(0x000f0000)
#define USB_ADDR_ENDP5_ENDPOINT_MSB    _u(19)
#define USB_ADDR_ENDP5_ENDPOINT_LSB    _u(16)
#define USB_ADDR_ENDP5_ENDPOINT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP5_ADDRESS
// Description : Device address
#define USB_ADDR_ENDP5_ADDRESS_RESET  _u(0x00)
#define USB_ADDR_ENDP5_ADDRESS_BITS   _u(0x0000007f)
#define USB_ADDR_ENDP5_ADDRESS_MSB    _u(6)
#define USB_ADDR_ENDP5_ADDRESS_LSB    _u(0)
#define USB_ADDR_ENDP5_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : USB_ADDR_ENDP6
// Description : Interrupt endpoint 6. Only valid for HOST mode.
#define USB_ADDR_ENDP6_OFFSET _u(0x00000018)
#define USB_ADDR_ENDP6_BITS   _u(0x060f007f)
#define USB_ADDR_ENDP6_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP6_INTEP_PREAMBLE
// Description : Interrupt EP requires preamble (is a low speed device on a full
//               speed hub)
#define USB_ADDR_ENDP6_INTEP_PREAMBLE_RESET  _u(0x0)
#define USB_ADDR_ENDP6_INTEP_PREAMBLE_BITS   _u(0x04000000)
#define USB_ADDR_ENDP6_INTEP_PREAMBLE_MSB    _u(26)
#define USB_ADDR_ENDP6_INTEP_PREAMBLE_LSB    _u(26)
#define USB_ADDR_ENDP6_INTEP_PREAMBLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP6_INTEP_DIR
// Description : Direction of the interrupt endpoint. In=0, Out=1
#define USB_ADDR_ENDP6_INTEP_DIR_RESET  _u(0x0)
#define USB_ADDR_ENDP6_INTEP_DIR_BITS   _u(0x02000000)
#define USB_ADDR_ENDP6_INTEP_DIR_MSB    _u(25)
#define USB_ADDR_ENDP6_INTEP_DIR_LSB    _u(25)
#define USB_ADDR_ENDP6_INTEP_DIR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP6_ENDPOINT
// Description : Endpoint number of the interrupt endpoint
#define USB_ADDR_ENDP6_ENDPOINT_RESET  _u(0x0)
#define USB_ADDR_ENDP6_ENDPOINT_BITS   _u(0x000f0000)
#define USB_ADDR_ENDP6_ENDPOINT_MSB    _u(19)
#define USB_ADDR_ENDP6_ENDPOINT_LSB    _u(16)
#define USB_ADDR_ENDP6_ENDPOINT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP6_ADDRESS
// Description : Device address
#define USB_ADDR_ENDP6_ADDRESS_RESET  _u(0x00)
#define USB_ADDR_ENDP6_ADDRESS_BITS   _u(0x0000007f)
#define USB_ADDR_ENDP6_ADDRESS_MSB    _u(6)
#define USB_ADDR_ENDP6_ADDRESS_LSB    _u(0)
#define USB_ADDR_ENDP6_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : USB_ADDR_ENDP7
// Description : Interrupt endpoint 7. Only valid for HOST mode.
#define USB_ADDR_ENDP7_OFFSET _u(0x0000001c)
#define USB_ADDR_ENDP7_BITS   _u(0x060f007f)
#define USB_ADDR_ENDP7_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP7_INTEP_PREAMBLE
// Description : Interrupt EP requires preamble (is a low speed device on a full
//               speed hub)
#define USB_ADDR_ENDP7_INTEP_PREAMBLE_RESET  _u(0x0)
#define USB_ADDR_ENDP7_INTEP_PREAMBLE_BITS   _u(0x04000000)
#define USB_ADDR_ENDP7_INTEP_PREAMBLE_MSB    _u(26)
#define USB_ADDR_ENDP7_INTEP_PREAMBLE_LSB    _u(26)
#define USB_ADDR_ENDP7_INTEP_PREAMBLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP7_INTEP_DIR
// Description : Direction of the interrupt endpoint. In=0, Out=1
#define USB_ADDR_ENDP7_INTEP_DIR_RESET  _u(0x0)
#define USB_ADDR_ENDP7_INTEP_DIR_BITS   _u(0x02000000)
#define USB_ADDR_ENDP7_INTEP_DIR_MSB    _u(25)
#define USB_ADDR_ENDP7_INTEP_DIR_LSB    _u(25)
#define USB_ADDR_ENDP7_INTEP_DIR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP7_ENDPOINT
// Description : Endpoint number of the interrupt endpoint
#define USB_ADDR_ENDP7_ENDPOINT_RESET  _u(0x0)
#define USB_ADDR_ENDP7_ENDPOINT_BITS   _u(0x000f0000)
#define USB_ADDR_ENDP7_ENDPOINT_MSB    _u(19)
#define USB_ADDR_ENDP7_ENDPOINT_LSB    _u(16)
#define USB_ADDR_ENDP7_ENDPOINT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP7_ADDRESS
// Description : Device address
#define USB_ADDR_ENDP7_ADDRESS_RESET  _u(0x00)
#define USB_ADDR_ENDP7_ADDRESS_BITS   _u(0x0000007f)
#define USB_ADDR_ENDP7_ADDRESS_MSB    _u(6)
#define USB_ADDR_ENDP7_ADDRESS_LSB    _u(0)
#define USB_ADDR_ENDP7_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : USB_ADDR_ENDP8
// Description : Interrupt endpoint 8. Only valid for HOST mode.
#define USB_ADDR_ENDP8_OFFSET _u(0x00000020)
#define USB_ADDR_ENDP8_BITS   _u(0x060f007f)
#define USB_ADDR_ENDP8_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP8_INTEP_PREAMBLE
// Description : Interrupt EP requires preamble (is a low speed device on a full
//               speed hub)
#define USB_ADDR_ENDP8_INTEP_PREAMBLE_RESET  _u(0x0)
#define USB_ADDR_ENDP8_INTEP_PREAMBLE_BITS   _u(0x04000000)
#define USB_ADDR_ENDP8_INTEP_PREAMBLE_MSB    _u(26)
#define USB_ADDR_ENDP8_INTEP_PREAMBLE_LSB    _u(26)
#define USB_ADDR_ENDP8_INTEP_PREAMBLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP8_INTEP_DIR
// Description : Direction of the interrupt endpoint. In=0, Out=1
#define USB_ADDR_ENDP8_INTEP_DIR_RESET  _u(0x0)
#define USB_ADDR_ENDP8_INTEP_DIR_BITS   _u(0x02000000)
#define USB_ADDR_ENDP8_INTEP_DIR_MSB    _u(25)
#define USB_ADDR_ENDP8_INTEP_DIR_LSB    _u(25)
#define USB_ADDR_ENDP8_INTEP_DIR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP8_ENDPOINT
// Description : Endpoint number of the interrupt endpoint
#define USB_ADDR_ENDP8_ENDPOINT_RESET  _u(0x0)
#define USB_ADDR_ENDP8_ENDPOINT_BITS   _u(0x000f0000)
#define USB_ADDR_ENDP8_ENDPOINT_MSB    _u(19)
#define USB_ADDR_ENDP8_ENDPOINT_LSB    _u(16)
#define USB_ADDR_ENDP8_ENDPOINT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP8_ADDRESS
// Description : Device address
#define USB_ADDR_ENDP8_ADDRESS_RESET  _u(0x00)
#define USB_ADDR_ENDP8_ADDRESS_BITS   _u(0x0000007f)
#define USB_ADDR_ENDP8_ADDRESS_MSB    _u(6)
#define USB_ADDR_ENDP8_ADDRESS_LSB    _u(0)
#define USB_ADDR_ENDP8_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : USB_ADDR_ENDP9
// Description : Interrupt endpoint 9. Only valid for HOST mode.
#define USB_ADDR_ENDP9_OFFSET _u(0x00000024)
#define USB_ADDR_ENDP9_BITS   _u(0x060f007f)
#define USB_ADDR_ENDP9_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP9_INTEP_PREAMBLE
// Description : Interrupt EP requires preamble (is a low speed device on a full
//               speed hub)
#define USB_ADDR_ENDP9_INTEP_PREAMBLE_RESET  _u(0x0)
#define USB_ADDR_ENDP9_INTEP_PREAMBLE_BITS   _u(0x04000000)
#define USB_ADDR_ENDP9_INTEP_PREAMBLE_MSB    _u(26)
#define USB_ADDR_ENDP9_INTEP_PREAMBLE_LSB    _u(26)
#define USB_ADDR_ENDP9_INTEP_PREAMBLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP9_INTEP_DIR
// Description : Direction of the interrupt endpoint. In=0, Out=1
#define USB_ADDR_ENDP9_INTEP_DIR_RESET  _u(0x0)
#define USB_ADDR_ENDP9_INTEP_DIR_BITS   _u(0x02000000)
#define USB_ADDR_ENDP9_INTEP_DIR_MSB    _u(25)
#define USB_ADDR_ENDP9_INTEP_DIR_LSB    _u(25)
#define USB_ADDR_ENDP9_INTEP_DIR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP9_ENDPOINT
// Description : Endpoint number of the interrupt endpoint
#define USB_ADDR_ENDP9_ENDPOINT_RESET  _u(0x0)
#define USB_ADDR_ENDP9_ENDPOINT_BITS   _u(0x000f0000)
#define USB_ADDR_ENDP9_ENDPOINT_MSB    _u(19)
#define USB_ADDR_ENDP9_ENDPOINT_LSB    _u(16)
#define USB_ADDR_ENDP9_ENDPOINT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP9_ADDRESS
// Description : Device address
#define USB_ADDR_ENDP9_ADDRESS_RESET  _u(0x00)
#define USB_ADDR_ENDP9_ADDRESS_BITS   _u(0x0000007f)
#define USB_ADDR_ENDP9_ADDRESS_MSB    _u(6)
#define USB_ADDR_ENDP9_ADDRESS_LSB    _u(0)
#define USB_ADDR_ENDP9_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : USB_ADDR_ENDP10
// Description : Interrupt endpoint 10. Only valid for HOST mode.
#define USB_ADDR_ENDP10_OFFSET _u(0x00000028)
#define USB_ADDR_ENDP10_BITS   _u(0x060f007f)
#define USB_ADDR_ENDP10_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP10_INTEP_PREAMBLE
// Description : Interrupt EP requires preamble (is a low speed device on a full
//               speed hub)
#define USB_ADDR_ENDP10_INTEP_PREAMBLE_RESET  _u(0x0)
#define USB_ADDR_ENDP10_INTEP_PREAMBLE_BITS   _u(0x04000000)
#define USB_ADDR_ENDP10_INTEP_PREAMBLE_MSB    _u(26)
#define USB_ADDR_ENDP10_INTEP_PREAMBLE_LSB    _u(26)
#define USB_ADDR_ENDP10_INTEP_PREAMBLE_ACCESS "RW"
// -----------------------------------------------------------------------------
