cherry-embedded/CherryUSB/port/rp2040/usb_rp2040_reg.h
#define USB_SIE_CTRL_SEND_DATA_BITS   _u(0x00000004)
#define USB_SIE_CTRL_SEND_DATA_MSB    _u(2)
#define USB_SIE_CTRL_SEND_DATA_LSB    _u(2)
#define USB_SIE_CTRL_SEND_DATA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_SEND_SETUP
// Description : Host: Send Setup packet
#define USB_SIE_CTRL_SEND_SETUP_RESET  _u(0x0)
#define USB_SIE_CTRL_SEND_SETUP_BITS   _u(0x00000002)
#define USB_SIE_CTRL_SEND_SETUP_MSB    _u(1)
#define USB_SIE_CTRL_SEND_SETUP_LSB    _u(1)
#define USB_SIE_CTRL_SEND_SETUP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_START_TRANS
// Description : Host: Start transaction
#define USB_SIE_CTRL_START_TRANS_RESET  _u(0x0)
#define USB_SIE_CTRL_START_TRANS_BITS   _u(0x00000001)
#define USB_SIE_CTRL_START_TRANS_MSB    _u(0)
#define USB_SIE_CTRL_START_TRANS_LSB    _u(0)
#define USB_SIE_CTRL_START_TRANS_ACCESS "SC"
// =============================================================================
// Register    : USB_SIE_STATUS
// Description : SIE status register
#define USB_SIE_STATUS_OFFSET _u(0x00000050)
#define USB_SIE_STATUS_BITS   _u(0xff0f0f1d)
#define USB_SIE_STATUS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_DATA_SEQ_ERROR
// Description : Data Sequence Error.
//
//               The device can raise a sequence error in the following
//               conditions:
//
//               * A SETUP packet is received followed by a DATA1 packet (data
//               phase should always be DATA0) * An OUT packet is received from
//               the host but doesn't match the data pid in the buffer control
//               register read from DPSRAM
//
//               The host can raise a data sequence error in the following
//               conditions:
//
//               * An IN packet from the device has the wrong data PID
#define USB_SIE_STATUS_DATA_SEQ_ERROR_RESET  _u(0x0)
#define USB_SIE_STATUS_DATA_SEQ_ERROR_BITS   _u(0x80000000)
#define USB_SIE_STATUS_DATA_SEQ_ERROR_MSB    _u(31)
#define USB_SIE_STATUS_DATA_SEQ_ERROR_LSB    _u(31)
#define USB_SIE_STATUS_DATA_SEQ_ERROR_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_ACK_REC
// Description : ACK received. Raised by both host and device.
#define USB_SIE_STATUS_ACK_REC_RESET  _u(0x0)
#define USB_SIE_STATUS_ACK_REC_BITS   _u(0x40000000)
#define USB_SIE_STATUS_ACK_REC_MSB    _u(30)
#define USB_SIE_STATUS_ACK_REC_LSB    _u(30)
#define USB_SIE_STATUS_ACK_REC_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_STALL_REC
// Description : Host: STALL received
#define USB_SIE_STATUS_STALL_REC_RESET  _u(0x0)
#define USB_SIE_STATUS_STALL_REC_BITS   _u(0x20000000)
#define USB_SIE_STATUS_STALL_REC_MSB    _u(29)
#define USB_SIE_STATUS_STALL_REC_LSB    _u(29)
#define USB_SIE_STATUS_STALL_REC_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_NAK_REC
// Description : Host: NAK received
#define USB_SIE_STATUS_NAK_REC_RESET  _u(0x0)
#define USB_SIE_STATUS_NAK_REC_BITS   _u(0x10000000)
#define USB_SIE_STATUS_NAK_REC_MSB    _u(28)
#define USB_SIE_STATUS_NAK_REC_LSB    _u(28)
#define USB_SIE_STATUS_NAK_REC_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_RX_TIMEOUT
// Description : RX timeout is raised by both the host and device if an ACK is
//               not received in the maximum time specified by the USB spec.
#define USB_SIE_STATUS_RX_TIMEOUT_RESET  _u(0x0)
#define USB_SIE_STATUS_RX_TIMEOUT_BITS   _u(0x08000000)
#define USB_SIE_STATUS_RX_TIMEOUT_MSB    _u(27)
#define USB_SIE_STATUS_RX_TIMEOUT_LSB    _u(27)
#define USB_SIE_STATUS_RX_TIMEOUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_RX_OVERFLOW
// Description : RX overflow is raised by the Serial RX engine if the incoming
//               data is too fast.
#define USB_SIE_STATUS_RX_OVERFLOW_RESET  _u(0x0)
#define USB_SIE_STATUS_RX_OVERFLOW_BITS   _u(0x04000000)
#define USB_SIE_STATUS_RX_OVERFLOW_MSB    _u(26)
#define USB_SIE_STATUS_RX_OVERFLOW_LSB    _u(26)
#define USB_SIE_STATUS_RX_OVERFLOW_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_BIT_STUFF_ERROR
// Description : Bit Stuff Error. Raised by the Serial RX engine.
#define USB_SIE_STATUS_BIT_STUFF_ERROR_RESET  _u(0x0)
#define USB_SIE_STATUS_BIT_STUFF_ERROR_BITS   _u(0x02000000)
#define USB_SIE_STATUS_BIT_STUFF_ERROR_MSB    _u(25)
#define USB_SIE_STATUS_BIT_STUFF_ERROR_LSB    _u(25)
#define USB_SIE_STATUS_BIT_STUFF_ERROR_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_CRC_ERROR
// Description : CRC Error. Raised by the Serial RX engine.
#define USB_SIE_STATUS_CRC_ERROR_RESET  _u(0x0)
#define USB_SIE_STATUS_CRC_ERROR_BITS   _u(0x01000000)
#define USB_SIE_STATUS_CRC_ERROR_MSB    _u(24)
#define USB_SIE_STATUS_CRC_ERROR_LSB    _u(24)
#define USB_SIE_STATUS_CRC_ERROR_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_BUS_RESET
// Description : Device: bus reset received
#define USB_SIE_STATUS_BUS_RESET_RESET  _u(0x0)
#define USB_SIE_STATUS_BUS_RESET_BITS   _u(0x00080000)
#define USB_SIE_STATUS_BUS_RESET_MSB    _u(19)
#define USB_SIE_STATUS_BUS_RESET_LSB    _u(19)
#define USB_SIE_STATUS_BUS_RESET_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_TRANS_COMPLETE
// Description : Transaction complete.
//
//               Raised by device if:
//
//               * An IN or OUT packet is sent with the `LAST_BUFF` bit set in
//               the buffer control register
//
//               Raised by host if:
//
//               * A setup packet is sent when no data in or data out
//               transaction follows * An IN packet is received and the
//               `LAST_BUFF` bit is set in the buffer control register * An IN
//               packet is received with zero length * An OUT packet is sent and
//               the `LAST_BUFF` bit is set
#define USB_SIE_STATUS_TRANS_COMPLETE_RESET  _u(0x0)
#define USB_SIE_STATUS_TRANS_COMPLETE_BITS   _u(0x00040000)
#define USB_SIE_STATUS_TRANS_COMPLETE_MSB    _u(18)
#define USB_SIE_STATUS_TRANS_COMPLETE_LSB    _u(18)
#define USB_SIE_STATUS_TRANS_COMPLETE_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_SETUP_REC
// Description : Device: Setup packet received
#define USB_SIE_STATUS_SETUP_REC_RESET  _u(0x0)
#define USB_SIE_STATUS_SETUP_REC_BITS   _u(0x00020000)
#define USB_SIE_STATUS_SETUP_REC_MSB    _u(17)
#define USB_SIE_STATUS_SETUP_REC_LSB    _u(17)
#define USB_SIE_STATUS_SETUP_REC_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_CONNECTED
// Description : Device: connected
#define USB_SIE_STATUS_CONNECTED_RESET  _u(0x0)
#define USB_SIE_STATUS_CONNECTED_BITS   _u(0x00010000)
#define USB_SIE_STATUS_CONNECTED_MSB    _u(16)
#define USB_SIE_STATUS_CONNECTED_LSB    _u(16)
#define USB_SIE_STATUS_CONNECTED_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_RESUME
// Description : Host: Device has initiated a remote resume. Device: host has
//               initiated a resume.
#define USB_SIE_STATUS_RESUME_RESET  _u(0x0)
#define USB_SIE_STATUS_RESUME_BITS   _u(0x00000800)
#define USB_SIE_STATUS_RESUME_MSB    _u(11)
#define USB_SIE_STATUS_RESUME_LSB    _u(11)
#define USB_SIE_STATUS_RESUME_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_VBUS_OVER_CURR
// Description : VBUS over current detected
#define USB_SIE_STATUS_VBUS_OVER_CURR_RESET  _u(0x0)
#define USB_SIE_STATUS_VBUS_OVER_CURR_BITS   _u(0x00000400)
#define USB_SIE_STATUS_VBUS_OVER_CURR_MSB    _u(10)
#define USB_SIE_STATUS_VBUS_OVER_CURR_LSB    _u(10)
#define USB_SIE_STATUS_VBUS_OVER_CURR_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_SPEED
// Description : Host: device speed. Disconnected = 00, LS = 01, FS = 10
#define USB_SIE_STATUS_SPEED_RESET  _u(0x0)
#define USB_SIE_STATUS_SPEED_BITS   _u(0x00000300)
#define USB_SIE_STATUS_SPEED_MSB    _u(9)
#define USB_SIE_STATUS_SPEED_LSB    _u(8)
#define USB_SIE_STATUS_SPEED_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_SUSPENDED
// Description : Bus in suspended state. Valid for device and host. Host and
//               device will go into suspend if neither Keep Alive / SOF frames
//               are enabled.
#define USB_SIE_STATUS_SUSPENDED_RESET  _u(0x0)
#define USB_SIE_STATUS_SUSPENDED_BITS   _u(0x00000010)
#define USB_SIE_STATUS_SUSPENDED_MSB    _u(4)
#define USB_SIE_STATUS_SUSPENDED_LSB    _u(4)
#define USB_SIE_STATUS_SUSPENDED_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_LINE_STATE
// Description : USB bus line state
#define USB_SIE_STATUS_LINE_STATE_RESET  _u(0x0)
#define USB_SIE_STATUS_LINE_STATE_BITS   _u(0x0000000c)
#define USB_SIE_STATUS_LINE_STATE_MSB    _u(3)
#define USB_SIE_STATUS_LINE_STATE_LSB    _u(2)
#define USB_SIE_STATUS_LINE_STATE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_VBUS_DETECTED
// Description : Device: VBUS Detected
#define USB_SIE_STATUS_VBUS_DETECTED_RESET  _u(0x0)
#define USB_SIE_STATUS_VBUS_DETECTED_BITS   _u(0x00000001)
#define USB_SIE_STATUS_VBUS_DETECTED_MSB    _u(0)
#define USB_SIE_STATUS_VBUS_DETECTED_LSB    _u(0)
#define USB_SIE_STATUS_VBUS_DETECTED_ACCESS "RO"
// =============================================================================
// Register    : USB_INT_EP_CTRL
// Description : interrupt endpoint control register
#define USB_INT_EP_CTRL_OFFSET _u(0x00000054)
#define USB_INT_EP_CTRL_BITS   _u(0x0000fffe)
#define USB_INT_EP_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_INT_EP_CTRL_INT_EP_ACTIVE
// Description : Host: Enable interrupt endpoint 1 -> 15
#define USB_INT_EP_CTRL_INT_EP_ACTIVE_RESET  _u(0x0000)
#define USB_INT_EP_CTRL_INT_EP_ACTIVE_BITS   _u(0x0000fffe)
#define USB_INT_EP_CTRL_INT_EP_ACTIVE_MSB    _u(15)
#define USB_INT_EP_CTRL_INT_EP_ACTIVE_LSB    _u(1)
#define USB_INT_EP_CTRL_INT_EP_ACTIVE_ACCESS "RW"
// =============================================================================
// Register    : USB_BUFF_STATUS
// Description : Buffer status register. A bit set here indicates that a buffer
//               has completed on the endpoint (if the buffer interrupt is
//               enabled). It is possible for 2 buffers to be completed, so
//               clearing the buffer status bit may instantly re set it on the
//               next clock cycle.
#define USB_BUFF_STATUS_OFFSET _u(0x00000058)
#define USB_BUFF_STATUS_BITS   _u(0xffffffff)
#define USB_BUFF_STATUS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP15_OUT
// Description : None
#define USB_BUFF_STATUS_EP15_OUT_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP15_OUT_BITS   _u(0x80000000)
#define USB_BUFF_STATUS_EP15_OUT_MSB    _u(31)
#define USB_BUFF_STATUS_EP15_OUT_LSB    _u(31)
#define USB_BUFF_STATUS_EP15_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP15_IN
// Description : None
#define USB_BUFF_STATUS_EP15_IN_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP15_IN_BITS   _u(0x40000000)
#define USB_BUFF_STATUS_EP15_IN_MSB    _u(30)
#define USB_BUFF_STATUS_EP15_IN_LSB    _u(30)
#define USB_BUFF_STATUS_EP15_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP14_OUT
// Description : None
#define USB_BUFF_STATUS_EP14_OUT_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP14_OUT_BITS   _u(0x20000000)
#define USB_BUFF_STATUS_EP14_OUT_MSB    _u(29)
#define USB_BUFF_STATUS_EP14_OUT_LSB    _u(29)
#define USB_BUFF_STATUS_EP14_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP14_IN
// Description : None
#define USB_BUFF_STATUS_EP14_IN_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP14_IN_BITS   _u(0x10000000)
#define USB_BUFF_STATUS_EP14_IN_MSB    _u(28)
#define USB_BUFF_STATUS_EP14_IN_LSB    _u(28)
#define USB_BUFF_STATUS_EP14_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP13_OUT
// Description : None
#define USB_BUFF_STATUS_EP13_OUT_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP13_OUT_BITS   _u(0x08000000)
#define USB_BUFF_STATUS_EP13_OUT_MSB    _u(27)
#define USB_BUFF_STATUS_EP13_OUT_LSB    _u(27)
#define USB_BUFF_STATUS_EP13_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP13_IN
// Description : None
#define USB_BUFF_STATUS_EP13_IN_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP13_IN_BITS   _u(0x04000000)
#define USB_BUFF_STATUS_EP13_IN_MSB    _u(26)
#define USB_BUFF_STATUS_EP13_IN_LSB    _u(26)
#define USB_BUFF_STATUS_EP13_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP12_OUT
// Description : None
#define USB_BUFF_STATUS_EP12_OUT_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP12_OUT_BITS   _u(0x02000000)
#define USB_BUFF_STATUS_EP12_OUT_MSB    _u(25)
#define USB_BUFF_STATUS_EP12_OUT_LSB    _u(25)
#define USB_BUFF_STATUS_EP12_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP12_IN
// Description : None
#define USB_BUFF_STATUS_EP12_IN_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP12_IN_BITS   _u(0x01000000)
#define USB_BUFF_STATUS_EP12_IN_MSB    _u(24)
#define USB_BUFF_STATUS_EP12_IN_LSB    _u(24)
#define USB_BUFF_STATUS_EP12_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP11_OUT
// Description : None
#define USB_BUFF_STATUS_EP11_OUT_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP11_OUT_BITS   _u(0x00800000)
#define USB_BUFF_STATUS_EP11_OUT_MSB    _u(23)
#define USB_BUFF_STATUS_EP11_OUT_LSB    _u(23)
#define USB_BUFF_STATUS_EP11_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP11_IN
// Description : None
#define USB_BUFF_STATUS_EP11_IN_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP11_IN_BITS   _u(0x00400000)
#define USB_BUFF_STATUS_EP11_IN_MSB    _u(22)
#define USB_BUFF_STATUS_EP11_IN_LSB    _u(22)
#define USB_BUFF_STATUS_EP11_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP10_OUT
// Description : None
#define USB_BUFF_STATUS_EP10_OUT_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP10_OUT_BITS   _u(0x00200000)
#define USB_BUFF_STATUS_EP10_OUT_MSB    _u(21)
#define USB_BUFF_STATUS_EP10_OUT_LSB    _u(21)
#define USB_BUFF_STATUS_EP10_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP10_IN
// Description : None
#define USB_BUFF_STATUS_EP10_IN_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP10_IN_BITS   _u(0x00100000)
#define USB_BUFF_STATUS_EP10_IN_MSB    _u(20)
#define USB_BUFF_STATUS_EP10_IN_LSB    _u(20)
#define USB_BUFF_STATUS_EP10_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP9_OUT
// Description : None
#define USB_BUFF_STATUS_EP9_OUT_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP9_OUT_BITS   _u(0x00080000)
#define USB_BUFF_STATUS_EP9_OUT_MSB    _u(19)
#define USB_BUFF_STATUS_EP9_OUT_LSB    _u(19)
#define USB_BUFF_STATUS_EP9_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP9_IN
// Description : None
#define USB_BUFF_STATUS_EP9_IN_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP9_IN_BITS   _u(0x00040000)
#define USB_BUFF_STATUS_EP9_IN_MSB    _u(18)
#define USB_BUFF_STATUS_EP9_IN_LSB    _u(18)
#define USB_BUFF_STATUS_EP9_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP8_OUT
// Description : None
#define USB_BUFF_STATUS_EP8_OUT_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP8_OUT_BITS   _u(0x00020000)
#define USB_BUFF_STATUS_EP8_OUT_MSB    _u(17)
#define USB_BUFF_STATUS_EP8_OUT_LSB    _u(17)
#define USB_BUFF_STATUS_EP8_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP8_IN
// Description : None
#define USB_BUFF_STATUS_EP8_IN_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP8_IN_BITS   _u(0x00010000)
#define USB_BUFF_STATUS_EP8_IN_MSB    _u(16)
#define USB_BUFF_STATUS_EP8_IN_LSB    _u(16)
#define USB_BUFF_STATUS_EP8_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP7_OUT
// Description : None
#define USB_BUFF_STATUS_EP7_OUT_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP7_OUT_BITS   _u(0x00008000)
#define USB_BUFF_STATUS_EP7_OUT_MSB    _u(15)
#define USB_BUFF_STATUS_EP7_OUT_LSB    _u(15)
#define USB_BUFF_STATUS_EP7_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP7_IN
// Description : None
#define USB_BUFF_STATUS_EP7_IN_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP7_IN_BITS   _u(0x00004000)
#define USB_BUFF_STATUS_EP7_IN_MSB    _u(14)
#define USB_BUFF_STATUS_EP7_IN_LSB    _u(14)
#define USB_BUFF_STATUS_EP7_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP6_OUT
// Description : None
#define USB_BUFF_STATUS_EP6_OUT_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP6_OUT_BITS   _u(0x00002000)
#define USB_BUFF_STATUS_EP6_OUT_MSB    _u(13)
#define USB_BUFF_STATUS_EP6_OUT_LSB    _u(13)
#define USB_BUFF_STATUS_EP6_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP6_IN
// Description : None
#define USB_BUFF_STATUS_EP6_IN_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP6_IN_BITS   _u(0x00001000)
#define USB_BUFF_STATUS_EP6_IN_MSB    _u(12)
#define USB_BUFF_STATUS_EP6_IN_LSB    _u(12)
#define USB_BUFF_STATUS_EP6_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP5_OUT
// Description : None
#define USB_BUFF_STATUS_EP5_OUT_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP5_OUT_BITS   _u(0x00000800)
#define USB_BUFF_STATUS_EP5_OUT_MSB    _u(11)
#define USB_BUFF_STATUS_EP5_OUT_LSB    _u(11)
#define USB_BUFF_STATUS_EP5_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP5_IN
// Description : None
#define USB_BUFF_STATUS_EP5_IN_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP5_IN_BITS   _u(0x00000400)
#define USB_BUFF_STATUS_EP5_IN_MSB    _u(10)
#define USB_BUFF_STATUS_EP5_IN_LSB    _u(10)
#define USB_BUFF_STATUS_EP5_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP4_OUT
// Description : None
#define USB_BUFF_STATUS_EP4_OUT_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP4_OUT_BITS   _u(0x00000200)
#define USB_BUFF_STATUS_EP4_OUT_MSB    _u(9)
#define USB_BUFF_STATUS_EP4_OUT_LSB    _u(9)
#define USB_BUFF_STATUS_EP4_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP4_IN
// Description : None
#define USB_BUFF_STATUS_EP4_IN_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP4_IN_BITS   _u(0x00000100)
#define USB_BUFF_STATUS_EP4_IN_MSB    _u(8)
#define USB_BUFF_STATUS_EP4_IN_LSB    _u(8)
#define USB_BUFF_STATUS_EP4_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP3_OUT
// Description : None
#define USB_BUFF_STATUS_EP3_OUT_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP3_OUT_BITS   _u(0x00000080)
#define USB_BUFF_STATUS_EP3_OUT_MSB    _u(7)
#define USB_BUFF_STATUS_EP3_OUT_LSB    _u(7)
#define USB_BUFF_STATUS_EP3_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP3_IN
// Description : None
#define USB_BUFF_STATUS_EP3_IN_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP3_IN_BITS   _u(0x00000040)
#define USB_BUFF_STATUS_EP3_IN_MSB    _u(6)
#define USB_BUFF_STATUS_EP3_IN_LSB    _u(6)
#define USB_BUFF_STATUS_EP3_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP2_OUT
// Description : None
#define USB_BUFF_STATUS_EP2_OUT_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP2_OUT_BITS   _u(0x00000020)
#define USB_BUFF_STATUS_EP2_OUT_MSB    _u(5)
#define USB_BUFF_STATUS_EP2_OUT_LSB    _u(5)
#define USB_BUFF_STATUS_EP2_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP2_IN
// Description : None
#define USB_BUFF_STATUS_EP2_IN_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP2_IN_BITS   _u(0x00000010)
#define USB_BUFF_STATUS_EP2_IN_MSB    _u(4)
#define USB_BUFF_STATUS_EP2_IN_LSB    _u(4)
#define USB_BUFF_STATUS_EP2_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP1_OUT
// Description : None
#define USB_BUFF_STATUS_EP1_OUT_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP1_OUT_BITS   _u(0x00000008)
#define USB_BUFF_STATUS_EP1_OUT_MSB    _u(3)
#define USB_BUFF_STATUS_EP1_OUT_LSB    _u(3)
#define USB_BUFF_STATUS_EP1_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP1_IN
// Description : None
#define USB_BUFF_STATUS_EP1_IN_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP1_IN_BITS   _u(0x00000004)
#define USB_BUFF_STATUS_EP1_IN_MSB    _u(2)
#define USB_BUFF_STATUS_EP1_IN_LSB    _u(2)
#define USB_BUFF_STATUS_EP1_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP0_OUT
// Description : None
#define USB_BUFF_STATUS_EP0_OUT_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP0_OUT_BITS   _u(0x00000002)
#define USB_BUFF_STATUS_EP0_OUT_MSB    _u(1)
#define USB_BUFF_STATUS_EP0_OUT_LSB    _u(1)
#define USB_BUFF_STATUS_EP0_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_STATUS_EP0_IN
// Description : None
#define USB_BUFF_STATUS_EP0_IN_RESET  _u(0x0)
#define USB_BUFF_STATUS_EP0_IN_BITS   _u(0x00000001)
#define USB_BUFF_STATUS_EP0_IN_MSB    _u(0)
#define USB_BUFF_STATUS_EP0_IN_LSB    _u(0)
#define USB_BUFF_STATUS_EP0_IN_ACCESS "WC"
// =============================================================================
// Register    : USB_BUFF_CPU_SHOULD_HANDLE
