cherry-embedded/CherryUSB/port/rp2040/usb_rp2040_reg.h
// Description : Which of the double buffers should be handled. Only valid if
//               using an interrupt per buffer (i.e. not per 2 buffers). Not
//               valid for host interrupt endpoint polling because they are only
//               single buffered.
#define USB_BUFF_CPU_SHOULD_HANDLE_OFFSET _u(0x0000005c)
#define USB_BUFF_CPU_SHOULD_HANDLE_BITS   _u(0xffffffff)
#define USB_BUFF_CPU_SHOULD_HANDLE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP15_OUT
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_OUT_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_OUT_BITS   _u(0x80000000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_OUT_MSB    _u(31)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_OUT_LSB    _u(31)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_OUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP15_IN
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_IN_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_IN_BITS   _u(0x40000000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_IN_MSB    _u(30)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_IN_LSB    _u(30)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_IN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP14_OUT
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_OUT_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_OUT_BITS   _u(0x20000000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_OUT_MSB    _u(29)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_OUT_LSB    _u(29)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_OUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP14_IN
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_IN_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_IN_BITS   _u(0x10000000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_IN_MSB    _u(28)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_IN_LSB    _u(28)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_IN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP13_OUT
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_OUT_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_OUT_BITS   _u(0x08000000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_OUT_MSB    _u(27)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_OUT_LSB    _u(27)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_OUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP13_IN
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_IN_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_IN_BITS   _u(0x04000000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_IN_MSB    _u(26)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_IN_LSB    _u(26)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_IN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP12_OUT
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_OUT_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_OUT_BITS   _u(0x02000000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_OUT_MSB    _u(25)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_OUT_LSB    _u(25)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_OUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP12_IN
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_IN_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_IN_BITS   _u(0x01000000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_IN_MSB    _u(24)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_IN_LSB    _u(24)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_IN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP11_OUT
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_OUT_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_OUT_BITS   _u(0x00800000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_OUT_MSB    _u(23)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_OUT_LSB    _u(23)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_OUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP11_IN
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_IN_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_IN_BITS   _u(0x00400000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_IN_MSB    _u(22)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_IN_LSB    _u(22)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_IN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP10_OUT
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_OUT_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_OUT_BITS   _u(0x00200000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_OUT_MSB    _u(21)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_OUT_LSB    _u(21)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_OUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP10_IN
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_IN_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_IN_BITS   _u(0x00100000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_IN_MSB    _u(20)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_IN_LSB    _u(20)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_IN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP9_OUT
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_OUT_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_OUT_BITS   _u(0x00080000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_OUT_MSB    _u(19)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_OUT_LSB    _u(19)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_OUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP9_IN
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_IN_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_IN_BITS   _u(0x00040000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_IN_MSB    _u(18)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_IN_LSB    _u(18)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_IN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP8_OUT
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_OUT_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_OUT_BITS   _u(0x00020000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_OUT_MSB    _u(17)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_OUT_LSB    _u(17)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_OUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP8_IN
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_IN_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_IN_BITS   _u(0x00010000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_IN_MSB    _u(16)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_IN_LSB    _u(16)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_IN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP7_OUT
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_OUT_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_OUT_BITS   _u(0x00008000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_OUT_MSB    _u(15)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_OUT_LSB    _u(15)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_OUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP7_IN
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_IN_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_IN_BITS   _u(0x00004000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_IN_MSB    _u(14)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_IN_LSB    _u(14)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_IN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP6_OUT
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_OUT_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_OUT_BITS   _u(0x00002000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_OUT_MSB    _u(13)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_OUT_LSB    _u(13)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_OUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP6_IN
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_IN_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_IN_BITS   _u(0x00001000)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_IN_MSB    _u(12)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_IN_LSB    _u(12)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_IN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP5_OUT
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_OUT_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_OUT_BITS   _u(0x00000800)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_OUT_MSB    _u(11)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_OUT_LSB    _u(11)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_OUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP5_IN
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_IN_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_IN_BITS   _u(0x00000400)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_IN_MSB    _u(10)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_IN_LSB    _u(10)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_IN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP4_OUT
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_OUT_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_OUT_BITS   _u(0x00000200)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_OUT_MSB    _u(9)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_OUT_LSB    _u(9)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_OUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP4_IN
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_IN_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_IN_BITS   _u(0x00000100)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_IN_MSB    _u(8)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_IN_LSB    _u(8)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_IN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP3_OUT
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_OUT_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_OUT_BITS   _u(0x00000080)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_OUT_MSB    _u(7)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_OUT_LSB    _u(7)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_OUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP3_IN
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_IN_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_IN_BITS   _u(0x00000040)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_IN_MSB    _u(6)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_IN_LSB    _u(6)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_IN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP2_OUT
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_OUT_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_OUT_BITS   _u(0x00000020)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_OUT_MSB    _u(5)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_OUT_LSB    _u(5)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_OUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP2_IN
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_IN_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_IN_BITS   _u(0x00000010)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_IN_MSB    _u(4)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_IN_LSB    _u(4)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_IN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP1_OUT
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_OUT_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_OUT_BITS   _u(0x00000008)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_OUT_MSB    _u(3)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_OUT_LSB    _u(3)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_OUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP1_IN
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_IN_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_IN_BITS   _u(0x00000004)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_IN_MSB    _u(2)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_IN_LSB    _u(2)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_IN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP0_OUT
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_OUT_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_OUT_BITS   _u(0x00000002)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_OUT_MSB    _u(1)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_OUT_LSB    _u(1)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_OUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP0_IN
// Description : None
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_IN_RESET  _u(0x0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_IN_BITS   _u(0x00000001)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_IN_MSB    _u(0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_IN_LSB    _u(0)
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_IN_ACCESS "RO"
// =============================================================================
// Register    : USB_EP_ABORT
// Description : Device only: Can be set to ignore the buffer control register
//               for this endpoint in case you would like to revoke a buffer. A
//               NAK will be sent for every access to the endpoint until this
//               bit is cleared. A corresponding bit in `EP_ABORT_DONE` is set
//               when it is safe to modify the buffer control register.
#define USB_EP_ABORT_OFFSET _u(0x00000060)
#define USB_EP_ABORT_BITS   _u(0xffffffff)
#define USB_EP_ABORT_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP15_OUT
// Description : None
#define USB_EP_ABORT_EP15_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_EP15_OUT_BITS   _u(0x80000000)
#define USB_EP_ABORT_EP15_OUT_MSB    _u(31)
#define USB_EP_ABORT_EP15_OUT_LSB    _u(31)
#define USB_EP_ABORT_EP15_OUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP15_IN
// Description : None
#define USB_EP_ABORT_EP15_IN_RESET  _u(0x0)
#define USB_EP_ABORT_EP15_IN_BITS   _u(0x40000000)
#define USB_EP_ABORT_EP15_IN_MSB    _u(30)
#define USB_EP_ABORT_EP15_IN_LSB    _u(30)
#define USB_EP_ABORT_EP15_IN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP14_OUT
// Description : None
#define USB_EP_ABORT_EP14_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_EP14_OUT_BITS   _u(0x20000000)
#define USB_EP_ABORT_EP14_OUT_MSB    _u(29)
#define USB_EP_ABORT_EP14_OUT_LSB    _u(29)
#define USB_EP_ABORT_EP14_OUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP14_IN
// Description : None
#define USB_EP_ABORT_EP14_IN_RESET  _u(0x0)
#define USB_EP_ABORT_EP14_IN_BITS   _u(0x10000000)
#define USB_EP_ABORT_EP14_IN_MSB    _u(28)
#define USB_EP_ABORT_EP14_IN_LSB    _u(28)
#define USB_EP_ABORT_EP14_IN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP13_OUT
// Description : None
#define USB_EP_ABORT_EP13_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_EP13_OUT_BITS   _u(0x08000000)
#define USB_EP_ABORT_EP13_OUT_MSB    _u(27)
#define USB_EP_ABORT_EP13_OUT_LSB    _u(27)
#define USB_EP_ABORT_EP13_OUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP13_IN
// Description : None
#define USB_EP_ABORT_EP13_IN_RESET  _u(0x0)
#define USB_EP_ABORT_EP13_IN_BITS   _u(0x04000000)
#define USB_EP_ABORT_EP13_IN_MSB    _u(26)
#define USB_EP_ABORT_EP13_IN_LSB    _u(26)
#define USB_EP_ABORT_EP13_IN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP12_OUT
// Description : None
#define USB_EP_ABORT_EP12_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_EP12_OUT_BITS   _u(0x02000000)
#define USB_EP_ABORT_EP12_OUT_MSB    _u(25)
#define USB_EP_ABORT_EP12_OUT_LSB    _u(25)
#define USB_EP_ABORT_EP12_OUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP12_IN
// Description : None
#define USB_EP_ABORT_EP12_IN_RESET  _u(0x0)
#define USB_EP_ABORT_EP12_IN_BITS   _u(0x01000000)
#define USB_EP_ABORT_EP12_IN_MSB    _u(24)
#define USB_EP_ABORT_EP12_IN_LSB    _u(24)
#define USB_EP_ABORT_EP12_IN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP11_OUT
// Description : None
#define USB_EP_ABORT_EP11_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_EP11_OUT_BITS   _u(0x00800000)
#define USB_EP_ABORT_EP11_OUT_MSB    _u(23)
#define USB_EP_ABORT_EP11_OUT_LSB    _u(23)
#define USB_EP_ABORT_EP11_OUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP11_IN
// Description : None
#define USB_EP_ABORT_EP11_IN_RESET  _u(0x0)
#define USB_EP_ABORT_EP11_IN_BITS   _u(0x00400000)
#define USB_EP_ABORT_EP11_IN_MSB    _u(22)
#define USB_EP_ABORT_EP11_IN_LSB    _u(22)
#define USB_EP_ABORT_EP11_IN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP10_OUT
// Description : None
#define USB_EP_ABORT_EP10_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_EP10_OUT_BITS   _u(0x00200000)
#define USB_EP_ABORT_EP10_OUT_MSB    _u(21)
#define USB_EP_ABORT_EP10_OUT_LSB    _u(21)
#define USB_EP_ABORT_EP10_OUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP10_IN
// Description : None
#define USB_EP_ABORT_EP10_IN_RESET  _u(0x0)
#define USB_EP_ABORT_EP10_IN_BITS   _u(0x00100000)
#define USB_EP_ABORT_EP10_IN_MSB    _u(20)
#define USB_EP_ABORT_EP10_IN_LSB    _u(20)
#define USB_EP_ABORT_EP10_IN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP9_OUT
// Description : None
#define USB_EP_ABORT_EP9_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_EP9_OUT_BITS   _u(0x00080000)
#define USB_EP_ABORT_EP9_OUT_MSB    _u(19)
#define USB_EP_ABORT_EP9_OUT_LSB    _u(19)
#define USB_EP_ABORT_EP9_OUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP9_IN
// Description : None
#define USB_EP_ABORT_EP9_IN_RESET  _u(0x0)
#define USB_EP_ABORT_EP9_IN_BITS   _u(0x00040000)
#define USB_EP_ABORT_EP9_IN_MSB    _u(18)
#define USB_EP_ABORT_EP9_IN_LSB    _u(18)
#define USB_EP_ABORT_EP9_IN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP8_OUT
// Description : None
#define USB_EP_ABORT_EP8_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_EP8_OUT_BITS   _u(0x00020000)
#define USB_EP_ABORT_EP8_OUT_MSB    _u(17)
#define USB_EP_ABORT_EP8_OUT_LSB    _u(17)
#define USB_EP_ABORT_EP8_OUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP8_IN
// Description : None
#define USB_EP_ABORT_EP8_IN_RESET  _u(0x0)
#define USB_EP_ABORT_EP8_IN_BITS   _u(0x00010000)
#define USB_EP_ABORT_EP8_IN_MSB    _u(16)
#define USB_EP_ABORT_EP8_IN_LSB    _u(16)
#define USB_EP_ABORT_EP8_IN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP7_OUT
// Description : None
#define USB_EP_ABORT_EP7_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_EP7_OUT_BITS   _u(0x00008000)
#define USB_EP_ABORT_EP7_OUT_MSB    _u(15)
#define USB_EP_ABORT_EP7_OUT_LSB    _u(15)
#define USB_EP_ABORT_EP7_OUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP7_IN
// Description : None
#define USB_EP_ABORT_EP7_IN_RESET  _u(0x0)
#define USB_EP_ABORT_EP7_IN_BITS   _u(0x00004000)
#define USB_EP_ABORT_EP7_IN_MSB    _u(14)
#define USB_EP_ABORT_EP7_IN_LSB    _u(14)
#define USB_EP_ABORT_EP7_IN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP6_OUT
// Description : None
#define USB_EP_ABORT_EP6_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_EP6_OUT_BITS   _u(0x00002000)
#define USB_EP_ABORT_EP6_OUT_MSB    _u(13)
#define USB_EP_ABORT_EP6_OUT_LSB    _u(13)
#define USB_EP_ABORT_EP6_OUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP6_IN
// Description : None
#define USB_EP_ABORT_EP6_IN_RESET  _u(0x0)
#define USB_EP_ABORT_EP6_IN_BITS   _u(0x00001000)
#define USB_EP_ABORT_EP6_IN_MSB    _u(12)
#define USB_EP_ABORT_EP6_IN_LSB    _u(12)
#define USB_EP_ABORT_EP6_IN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP5_OUT
// Description : None
#define USB_EP_ABORT_EP5_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_EP5_OUT_BITS   _u(0x00000800)
#define USB_EP_ABORT_EP5_OUT_MSB    _u(11)
#define USB_EP_ABORT_EP5_OUT_LSB    _u(11)
#define USB_EP_ABORT_EP5_OUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP5_IN
// Description : None
#define USB_EP_ABORT_EP5_IN_RESET  _u(0x0)
#define USB_EP_ABORT_EP5_IN_BITS   _u(0x00000400)
#define USB_EP_ABORT_EP5_IN_MSB    _u(10)
#define USB_EP_ABORT_EP5_IN_LSB    _u(10)
#define USB_EP_ABORT_EP5_IN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP4_OUT
// Description : None
#define USB_EP_ABORT_EP4_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_EP4_OUT_BITS   _u(0x00000200)
#define USB_EP_ABORT_EP4_OUT_MSB    _u(9)
#define USB_EP_ABORT_EP4_OUT_LSB    _u(9)
#define USB_EP_ABORT_EP4_OUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP4_IN
// Description : None
#define USB_EP_ABORT_EP4_IN_RESET  _u(0x0)
#define USB_EP_ABORT_EP4_IN_BITS   _u(0x00000100)
#define USB_EP_ABORT_EP4_IN_MSB    _u(8)
#define USB_EP_ABORT_EP4_IN_LSB    _u(8)
