cherry-embedded/CherryUSB/port/rp2040/usb_rp2040_reg.h
#define USB_EP_ABORT_EP4_IN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP3_OUT
// Description : None
#define USB_EP_ABORT_EP3_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_EP3_OUT_BITS   _u(0x00000080)
#define USB_EP_ABORT_EP3_OUT_MSB    _u(7)
#define USB_EP_ABORT_EP3_OUT_LSB    _u(7)
#define USB_EP_ABORT_EP3_OUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP3_IN
// Description : None
#define USB_EP_ABORT_EP3_IN_RESET  _u(0x0)
#define USB_EP_ABORT_EP3_IN_BITS   _u(0x00000040)
#define USB_EP_ABORT_EP3_IN_MSB    _u(6)
#define USB_EP_ABORT_EP3_IN_LSB    _u(6)
#define USB_EP_ABORT_EP3_IN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP2_OUT
// Description : None
#define USB_EP_ABORT_EP2_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_EP2_OUT_BITS   _u(0x00000020)
#define USB_EP_ABORT_EP2_OUT_MSB    _u(5)
#define USB_EP_ABORT_EP2_OUT_LSB    _u(5)
#define USB_EP_ABORT_EP2_OUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP2_IN
// Description : None
#define USB_EP_ABORT_EP2_IN_RESET  _u(0x0)
#define USB_EP_ABORT_EP2_IN_BITS   _u(0x00000010)
#define USB_EP_ABORT_EP2_IN_MSB    _u(4)
#define USB_EP_ABORT_EP2_IN_LSB    _u(4)
#define USB_EP_ABORT_EP2_IN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP1_OUT
// Description : None
#define USB_EP_ABORT_EP1_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_EP1_OUT_BITS   _u(0x00000008)
#define USB_EP_ABORT_EP1_OUT_MSB    _u(3)
#define USB_EP_ABORT_EP1_OUT_LSB    _u(3)
#define USB_EP_ABORT_EP1_OUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP1_IN
// Description : None
#define USB_EP_ABORT_EP1_IN_RESET  _u(0x0)
#define USB_EP_ABORT_EP1_IN_BITS   _u(0x00000004)
#define USB_EP_ABORT_EP1_IN_MSB    _u(2)
#define USB_EP_ABORT_EP1_IN_LSB    _u(2)
#define USB_EP_ABORT_EP1_IN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP0_OUT
// Description : None
#define USB_EP_ABORT_EP0_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_EP0_OUT_BITS   _u(0x00000002)
#define USB_EP_ABORT_EP0_OUT_MSB    _u(1)
#define USB_EP_ABORT_EP0_OUT_LSB    _u(1)
#define USB_EP_ABORT_EP0_OUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_EP0_IN
// Description : None
#define USB_EP_ABORT_EP0_IN_RESET  _u(0x0)
#define USB_EP_ABORT_EP0_IN_BITS   _u(0x00000001)
#define USB_EP_ABORT_EP0_IN_MSB    _u(0)
#define USB_EP_ABORT_EP0_IN_LSB    _u(0)
#define USB_EP_ABORT_EP0_IN_ACCESS "RW"
// =============================================================================
// Register    : USB_EP_ABORT_DONE
// Description : Device only: Used in conjunction with `EP_ABORT`. Set once an
//               endpoint is idle so the programmer knows it is safe to modify
//               the buffer control register.
#define USB_EP_ABORT_DONE_OFFSET _u(0x00000064)
#define USB_EP_ABORT_DONE_BITS   _u(0xffffffff)
#define USB_EP_ABORT_DONE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP15_OUT
// Description : None
#define USB_EP_ABORT_DONE_EP15_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP15_OUT_BITS   _u(0x80000000)
#define USB_EP_ABORT_DONE_EP15_OUT_MSB    _u(31)
#define USB_EP_ABORT_DONE_EP15_OUT_LSB    _u(31)
#define USB_EP_ABORT_DONE_EP15_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP15_IN
// Description : None
#define USB_EP_ABORT_DONE_EP15_IN_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP15_IN_BITS   _u(0x40000000)
#define USB_EP_ABORT_DONE_EP15_IN_MSB    _u(30)
#define USB_EP_ABORT_DONE_EP15_IN_LSB    _u(30)
#define USB_EP_ABORT_DONE_EP15_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP14_OUT
// Description : None
#define USB_EP_ABORT_DONE_EP14_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP14_OUT_BITS   _u(0x20000000)
#define USB_EP_ABORT_DONE_EP14_OUT_MSB    _u(29)
#define USB_EP_ABORT_DONE_EP14_OUT_LSB    _u(29)
#define USB_EP_ABORT_DONE_EP14_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP14_IN
// Description : None
#define USB_EP_ABORT_DONE_EP14_IN_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP14_IN_BITS   _u(0x10000000)
#define USB_EP_ABORT_DONE_EP14_IN_MSB    _u(28)
#define USB_EP_ABORT_DONE_EP14_IN_LSB    _u(28)
#define USB_EP_ABORT_DONE_EP14_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP13_OUT
// Description : None
#define USB_EP_ABORT_DONE_EP13_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP13_OUT_BITS   _u(0x08000000)
#define USB_EP_ABORT_DONE_EP13_OUT_MSB    _u(27)
#define USB_EP_ABORT_DONE_EP13_OUT_LSB    _u(27)
#define USB_EP_ABORT_DONE_EP13_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP13_IN
// Description : None
#define USB_EP_ABORT_DONE_EP13_IN_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP13_IN_BITS   _u(0x04000000)
#define USB_EP_ABORT_DONE_EP13_IN_MSB    _u(26)
#define USB_EP_ABORT_DONE_EP13_IN_LSB    _u(26)
#define USB_EP_ABORT_DONE_EP13_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP12_OUT
// Description : None
#define USB_EP_ABORT_DONE_EP12_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP12_OUT_BITS   _u(0x02000000)
#define USB_EP_ABORT_DONE_EP12_OUT_MSB    _u(25)
#define USB_EP_ABORT_DONE_EP12_OUT_LSB    _u(25)
#define USB_EP_ABORT_DONE_EP12_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP12_IN
// Description : None
#define USB_EP_ABORT_DONE_EP12_IN_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP12_IN_BITS   _u(0x01000000)
#define USB_EP_ABORT_DONE_EP12_IN_MSB    _u(24)
#define USB_EP_ABORT_DONE_EP12_IN_LSB    _u(24)
#define USB_EP_ABORT_DONE_EP12_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP11_OUT
// Description : None
#define USB_EP_ABORT_DONE_EP11_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP11_OUT_BITS   _u(0x00800000)
#define USB_EP_ABORT_DONE_EP11_OUT_MSB    _u(23)
#define USB_EP_ABORT_DONE_EP11_OUT_LSB    _u(23)
#define USB_EP_ABORT_DONE_EP11_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP11_IN
// Description : None
#define USB_EP_ABORT_DONE_EP11_IN_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP11_IN_BITS   _u(0x00400000)
#define USB_EP_ABORT_DONE_EP11_IN_MSB    _u(22)
#define USB_EP_ABORT_DONE_EP11_IN_LSB    _u(22)
#define USB_EP_ABORT_DONE_EP11_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP10_OUT
// Description : None
#define USB_EP_ABORT_DONE_EP10_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP10_OUT_BITS   _u(0x00200000)
#define USB_EP_ABORT_DONE_EP10_OUT_MSB    _u(21)
#define USB_EP_ABORT_DONE_EP10_OUT_LSB    _u(21)
#define USB_EP_ABORT_DONE_EP10_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP10_IN
// Description : None
#define USB_EP_ABORT_DONE_EP10_IN_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP10_IN_BITS   _u(0x00100000)
#define USB_EP_ABORT_DONE_EP10_IN_MSB    _u(20)
#define USB_EP_ABORT_DONE_EP10_IN_LSB    _u(20)
#define USB_EP_ABORT_DONE_EP10_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP9_OUT
// Description : None
#define USB_EP_ABORT_DONE_EP9_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP9_OUT_BITS   _u(0x00080000)
#define USB_EP_ABORT_DONE_EP9_OUT_MSB    _u(19)
#define USB_EP_ABORT_DONE_EP9_OUT_LSB    _u(19)
#define USB_EP_ABORT_DONE_EP9_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP9_IN
// Description : None
#define USB_EP_ABORT_DONE_EP9_IN_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP9_IN_BITS   _u(0x00040000)
#define USB_EP_ABORT_DONE_EP9_IN_MSB    _u(18)
#define USB_EP_ABORT_DONE_EP9_IN_LSB    _u(18)
#define USB_EP_ABORT_DONE_EP9_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP8_OUT
// Description : None
#define USB_EP_ABORT_DONE_EP8_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP8_OUT_BITS   _u(0x00020000)
#define USB_EP_ABORT_DONE_EP8_OUT_MSB    _u(17)
#define USB_EP_ABORT_DONE_EP8_OUT_LSB    _u(17)
#define USB_EP_ABORT_DONE_EP8_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP8_IN
// Description : None
#define USB_EP_ABORT_DONE_EP8_IN_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP8_IN_BITS   _u(0x00010000)
#define USB_EP_ABORT_DONE_EP8_IN_MSB    _u(16)
#define USB_EP_ABORT_DONE_EP8_IN_LSB    _u(16)
#define USB_EP_ABORT_DONE_EP8_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP7_OUT
// Description : None
#define USB_EP_ABORT_DONE_EP7_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP7_OUT_BITS   _u(0x00008000)
#define USB_EP_ABORT_DONE_EP7_OUT_MSB    _u(15)
#define USB_EP_ABORT_DONE_EP7_OUT_LSB    _u(15)
#define USB_EP_ABORT_DONE_EP7_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP7_IN
// Description : None
#define USB_EP_ABORT_DONE_EP7_IN_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP7_IN_BITS   _u(0x00004000)
#define USB_EP_ABORT_DONE_EP7_IN_MSB    _u(14)
#define USB_EP_ABORT_DONE_EP7_IN_LSB    _u(14)
#define USB_EP_ABORT_DONE_EP7_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP6_OUT
// Description : None
#define USB_EP_ABORT_DONE_EP6_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP6_OUT_BITS   _u(0x00002000)
#define USB_EP_ABORT_DONE_EP6_OUT_MSB    _u(13)
#define USB_EP_ABORT_DONE_EP6_OUT_LSB    _u(13)
#define USB_EP_ABORT_DONE_EP6_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP6_IN
// Description : None
#define USB_EP_ABORT_DONE_EP6_IN_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP6_IN_BITS   _u(0x00001000)
#define USB_EP_ABORT_DONE_EP6_IN_MSB    _u(12)
#define USB_EP_ABORT_DONE_EP6_IN_LSB    _u(12)
#define USB_EP_ABORT_DONE_EP6_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP5_OUT
// Description : None
#define USB_EP_ABORT_DONE_EP5_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP5_OUT_BITS   _u(0x00000800)
#define USB_EP_ABORT_DONE_EP5_OUT_MSB    _u(11)
#define USB_EP_ABORT_DONE_EP5_OUT_LSB    _u(11)
#define USB_EP_ABORT_DONE_EP5_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP5_IN
// Description : None
#define USB_EP_ABORT_DONE_EP5_IN_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP5_IN_BITS   _u(0x00000400)
#define USB_EP_ABORT_DONE_EP5_IN_MSB    _u(10)
#define USB_EP_ABORT_DONE_EP5_IN_LSB    _u(10)
#define USB_EP_ABORT_DONE_EP5_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP4_OUT
// Description : None
#define USB_EP_ABORT_DONE_EP4_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP4_OUT_BITS   _u(0x00000200)
#define USB_EP_ABORT_DONE_EP4_OUT_MSB    _u(9)
#define USB_EP_ABORT_DONE_EP4_OUT_LSB    _u(9)
#define USB_EP_ABORT_DONE_EP4_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP4_IN
// Description : None
#define USB_EP_ABORT_DONE_EP4_IN_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP4_IN_BITS   _u(0x00000100)
#define USB_EP_ABORT_DONE_EP4_IN_MSB    _u(8)
#define USB_EP_ABORT_DONE_EP4_IN_LSB    _u(8)
#define USB_EP_ABORT_DONE_EP4_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP3_OUT
// Description : None
#define USB_EP_ABORT_DONE_EP3_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP3_OUT_BITS   _u(0x00000080)
#define USB_EP_ABORT_DONE_EP3_OUT_MSB    _u(7)
#define USB_EP_ABORT_DONE_EP3_OUT_LSB    _u(7)
#define USB_EP_ABORT_DONE_EP3_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP3_IN
// Description : None
#define USB_EP_ABORT_DONE_EP3_IN_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP3_IN_BITS   _u(0x00000040)
#define USB_EP_ABORT_DONE_EP3_IN_MSB    _u(6)
#define USB_EP_ABORT_DONE_EP3_IN_LSB    _u(6)
#define USB_EP_ABORT_DONE_EP3_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP2_OUT
// Description : None
#define USB_EP_ABORT_DONE_EP2_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP2_OUT_BITS   _u(0x00000020)
#define USB_EP_ABORT_DONE_EP2_OUT_MSB    _u(5)
#define USB_EP_ABORT_DONE_EP2_OUT_LSB    _u(5)
#define USB_EP_ABORT_DONE_EP2_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP2_IN
// Description : None
#define USB_EP_ABORT_DONE_EP2_IN_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP2_IN_BITS   _u(0x00000010)
#define USB_EP_ABORT_DONE_EP2_IN_MSB    _u(4)
#define USB_EP_ABORT_DONE_EP2_IN_LSB    _u(4)
#define USB_EP_ABORT_DONE_EP2_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP1_OUT
// Description : None
#define USB_EP_ABORT_DONE_EP1_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP1_OUT_BITS   _u(0x00000008)
#define USB_EP_ABORT_DONE_EP1_OUT_MSB    _u(3)
#define USB_EP_ABORT_DONE_EP1_OUT_LSB    _u(3)
#define USB_EP_ABORT_DONE_EP1_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP1_IN
// Description : None
#define USB_EP_ABORT_DONE_EP1_IN_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP1_IN_BITS   _u(0x00000004)
#define USB_EP_ABORT_DONE_EP1_IN_MSB    _u(2)
#define USB_EP_ABORT_DONE_EP1_IN_LSB    _u(2)
#define USB_EP_ABORT_DONE_EP1_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP0_OUT
// Description : None
#define USB_EP_ABORT_DONE_EP0_OUT_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP0_OUT_BITS   _u(0x00000002)
#define USB_EP_ABORT_DONE_EP0_OUT_MSB    _u(1)
#define USB_EP_ABORT_DONE_EP0_OUT_LSB    _u(1)
#define USB_EP_ABORT_DONE_EP0_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_ABORT_DONE_EP0_IN
// Description : None
#define USB_EP_ABORT_DONE_EP0_IN_RESET  _u(0x0)
#define USB_EP_ABORT_DONE_EP0_IN_BITS   _u(0x00000001)
#define USB_EP_ABORT_DONE_EP0_IN_MSB    _u(0)
#define USB_EP_ABORT_DONE_EP0_IN_LSB    _u(0)
#define USB_EP_ABORT_DONE_EP0_IN_ACCESS "WC"
// =============================================================================
// Register    : USB_EP_STALL_ARM
// Description : Device: this bit must be set in conjunction with the `STALL`
//               bit in the buffer control register to send a STALL on EP0. The
//               device controller clears these bits when a SETUP packet is
//               received because the USB spec requires that a STALL condition
//               is cleared when a SETUP packet is received.
#define USB_EP_STALL_ARM_OFFSET _u(0x00000068)
#define USB_EP_STALL_ARM_BITS   _u(0x00000003)
#define USB_EP_STALL_ARM_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_EP_STALL_ARM_EP0_OUT
// Description : None
#define USB_EP_STALL_ARM_EP0_OUT_RESET  _u(0x0)
#define USB_EP_STALL_ARM_EP0_OUT_BITS   _u(0x00000002)
#define USB_EP_STALL_ARM_EP0_OUT_MSB    _u(1)
#define USB_EP_STALL_ARM_EP0_OUT_LSB    _u(1)
#define USB_EP_STALL_ARM_EP0_OUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STALL_ARM_EP0_IN
// Description : None
#define USB_EP_STALL_ARM_EP0_IN_RESET  _u(0x0)
#define USB_EP_STALL_ARM_EP0_IN_BITS   _u(0x00000001)
#define USB_EP_STALL_ARM_EP0_IN_MSB    _u(0)
#define USB_EP_STALL_ARM_EP0_IN_LSB    _u(0)
#define USB_EP_STALL_ARM_EP0_IN_ACCESS "RW"
// =============================================================================
// Register    : USB_NAK_POLL
// Description : Used by the host controller. Sets the wait time in microseconds
//               before trying again if the device replies with a NAK.
#define USB_NAK_POLL_OFFSET _u(0x0000006c)
#define USB_NAK_POLL_BITS   _u(0x03ff03ff)
#define USB_NAK_POLL_RESET  _u(0x00100010)
// -----------------------------------------------------------------------------
// Field       : USB_NAK_POLL_DELAY_FS
// Description : NAK polling interval for a full speed device
#define USB_NAK_POLL_DELAY_FS_RESET  _u(0x010)
#define USB_NAK_POLL_DELAY_FS_BITS   _u(0x03ff0000)
#define USB_NAK_POLL_DELAY_FS_MSB    _u(25)
#define USB_NAK_POLL_DELAY_FS_LSB    _u(16)
#define USB_NAK_POLL_DELAY_FS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_NAK_POLL_DELAY_LS
// Description : NAK polling interval for a low speed device
#define USB_NAK_POLL_DELAY_LS_RESET  _u(0x010)
#define USB_NAK_POLL_DELAY_LS_BITS   _u(0x000003ff)
#define USB_NAK_POLL_DELAY_LS_MSB    _u(9)
#define USB_NAK_POLL_DELAY_LS_LSB    _u(0)
#define USB_NAK_POLL_DELAY_LS_ACCESS "RW"
// =============================================================================
// Register    : USB_EP_STATUS_STALL_NAK
// Description : Device: bits are set when the `IRQ_ON_NAK` or `IRQ_ON_STALL`
//               bits are set. For EP0 this comes from `SIE_CTRL`. For all other
//               endpoints it comes from the endpoint control register.
#define USB_EP_STATUS_STALL_NAK_OFFSET _u(0x00000070)
#define USB_EP_STATUS_STALL_NAK_BITS   _u(0xffffffff)
#define USB_EP_STATUS_STALL_NAK_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP15_OUT
// Description : None
#define USB_EP_STATUS_STALL_NAK_EP15_OUT_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP15_OUT_BITS   _u(0x80000000)
#define USB_EP_STATUS_STALL_NAK_EP15_OUT_MSB    _u(31)
#define USB_EP_STATUS_STALL_NAK_EP15_OUT_LSB    _u(31)
#define USB_EP_STATUS_STALL_NAK_EP15_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP15_IN
// Description : None
#define USB_EP_STATUS_STALL_NAK_EP15_IN_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP15_IN_BITS   _u(0x40000000)
#define USB_EP_STATUS_STALL_NAK_EP15_IN_MSB    _u(30)
#define USB_EP_STATUS_STALL_NAK_EP15_IN_LSB    _u(30)
#define USB_EP_STATUS_STALL_NAK_EP15_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP14_OUT
// Description : None
#define USB_EP_STATUS_STALL_NAK_EP14_OUT_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP14_OUT_BITS   _u(0x20000000)
#define USB_EP_STATUS_STALL_NAK_EP14_OUT_MSB    _u(29)
#define USB_EP_STATUS_STALL_NAK_EP14_OUT_LSB    _u(29)
#define USB_EP_STATUS_STALL_NAK_EP14_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP14_IN
// Description : None
#define USB_EP_STATUS_STALL_NAK_EP14_IN_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP14_IN_BITS   _u(0x10000000)
#define USB_EP_STATUS_STALL_NAK_EP14_IN_MSB    _u(28)
#define USB_EP_STATUS_STALL_NAK_EP14_IN_LSB    _u(28)
#define USB_EP_STATUS_STALL_NAK_EP14_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP13_OUT
// Description : None
#define USB_EP_STATUS_STALL_NAK_EP13_OUT_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP13_OUT_BITS   _u(0x08000000)
#define USB_EP_STATUS_STALL_NAK_EP13_OUT_MSB    _u(27)
#define USB_EP_STATUS_STALL_NAK_EP13_OUT_LSB    _u(27)
#define USB_EP_STATUS_STALL_NAK_EP13_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP13_IN
// Description : None
#define USB_EP_STATUS_STALL_NAK_EP13_IN_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP13_IN_BITS   _u(0x04000000)
#define USB_EP_STATUS_STALL_NAK_EP13_IN_MSB    _u(26)
#define USB_EP_STATUS_STALL_NAK_EP13_IN_LSB    _u(26)
#define USB_EP_STATUS_STALL_NAK_EP13_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP12_OUT
// Description : None
#define USB_EP_STATUS_STALL_NAK_EP12_OUT_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP12_OUT_BITS   _u(0x02000000)
#define USB_EP_STATUS_STALL_NAK_EP12_OUT_MSB    _u(25)
#define USB_EP_STATUS_STALL_NAK_EP12_OUT_LSB    _u(25)
#define USB_EP_STATUS_STALL_NAK_EP12_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP12_IN
// Description : None
#define USB_EP_STATUS_STALL_NAK_EP12_IN_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP12_IN_BITS   _u(0x01000000)
#define USB_EP_STATUS_STALL_NAK_EP12_IN_MSB    _u(24)
#define USB_EP_STATUS_STALL_NAK_EP12_IN_LSB    _u(24)
#define USB_EP_STATUS_STALL_NAK_EP12_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP11_OUT
// Description : None
#define USB_EP_STATUS_STALL_NAK_EP11_OUT_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP11_OUT_BITS   _u(0x00800000)
#define USB_EP_STATUS_STALL_NAK_EP11_OUT_MSB    _u(23)
#define USB_EP_STATUS_STALL_NAK_EP11_OUT_LSB    _u(23)
#define USB_EP_STATUS_STALL_NAK_EP11_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP11_IN
// Description : None
#define USB_EP_STATUS_STALL_NAK_EP11_IN_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP11_IN_BITS   _u(0x00400000)
#define USB_EP_STATUS_STALL_NAK_EP11_IN_MSB    _u(22)
#define USB_EP_STATUS_STALL_NAK_EP11_IN_LSB    _u(22)
#define USB_EP_STATUS_STALL_NAK_EP11_IN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP10_OUT
// Description : None
#define USB_EP_STATUS_STALL_NAK_EP10_OUT_RESET  _u(0x0)
#define USB_EP_STATUS_STALL_NAK_EP10_OUT_BITS   _u(0x00200000)
#define USB_EP_STATUS_STALL_NAK_EP10_OUT_MSB    _u(21)
#define USB_EP_STATUS_STALL_NAK_EP10_OUT_LSB    _u(21)
#define USB_EP_STATUS_STALL_NAK_EP10_OUT_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_EP_STATUS_STALL_NAK_EP10_IN
// Description : None
#define USB_EP_STATUS_STALL_NAK_EP10_IN_RESET  _u(0x0)
