cherry-embedded/CherryUSB/port/rp2040/usb_rp2040_reg.h
#define REG_ALIAS_RW_BITS  (0x0u << 12u)
#define REG_ALIAS_XOR_BITS (0x1u << 12u)
#define REG_ALIAS_SET_BITS (0x2u << 12u)
#define REG_ALIAS_CLR_BITS (0x3u << 12u)

#define hw_alias_check_addr(addr)  ((uintptr_t)(addr))
#define hw_set_alias_untyped(addr) ((void *)(REG_ALIAS_SET_BITS | hw_alias_check_addr(addr)))
#define hw_set_alias(p)            ((typeof(p))hw_set_alias_untyped(p))
#define usb_hw_set                 hw_set_alias(usb_hw)

#define hw_alias_check_addr(addr)    ((uintptr_t)(addr))
#define hw_clear_alias_untyped(addr) ((void *)(REG_ALIAS_CLR_BITS | hw_alias_check_addr(addr)))
#define hw_clear_alias(p)            ((typeof(p))hw_clear_alias_untyped(p))
#define usb_hw_clear                 hw_clear_alias(usb_hw)

/*! \brief Atomically set the specified bits to 1 in a HW register
 *  \ingroup hardware_base
 *
 * \param addr Address of writable register
 * \param mask Bit-mask specifying bits to set
 */
__force_inline static void hw_set_bits(io_rw_32 *addr, uint32_t mask)
{
    *(io_rw_32 *)hw_set_alias_untyped((volatile void *)addr) = mask;
}

/*! \brief Atomically clear the specified bits to 0 in a HW register
 *  \ingroup hardware_base
 *
 * \param addr Address of writable register
 * \param mask Bit-mask specifying bits to clear
 */
__force_inline static void hw_clear_bits(io_rw_32 *addr, uint32_t mask)
{
    *(io_rw_32 *)hw_clear_alias_untyped((volatile void *)addr) = mask;
}

/*! \brief Reset the specified HW blocks
 *  \ingroup hardware_resets
 *
 * \param bits Bit pattern indicating blocks to reset. See \ref reset_bitmask
 */
static inline void reset_block(uint32_t bits)
{
    hw_set_bits(&resets_hw->reset, bits);
}

/*! \brief Bring specified HW blocks out of reset and wait for completion
 *  \ingroup hardware_resets
 *
 * \param bits Bit pattern indicating blocks to unreset. See \ref reset_bitmask
 */
static inline void unreset_block_wait(uint32_t bits)
{
    hw_clear_bits(&resets_hw->reset, bits);
    while (~resets_hw->reset_done & bits) {
    }
}